analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/gcr_regs.h
/**@} end of group GCR_SYSINTEN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCERR GCR_ECCERR
 * @brief    ECC Error Register
 * @{
 */
#define MXC_F_GCR_ECCERR_FLASH_POS                     0 /**< ECCERR_FLASH Position */
#define MXC_F_GCR_ECCERR_FLASH                         ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_FLASH_POS)) /**< ECCERR_FLASH Mask */

/**@} end of group GCR_ECCERR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCCED GCR_ECCCED
 * @brief    ECC Correctable Error Detect Register.
 * @{
 */
#define MXC_F_GCR_ECCCED_FLASH_POS                     0 /**< ECCCED_FLASH Position */
#define MXC_F_GCR_ECCCED_FLASH                         ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_FLASH_POS)) /**< ECCCED_FLASH Mask */

/**@} end of group GCR_ECCCED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCINTEN GCR_ECCINTEN
 * @brief    ECC Interrupt Enable Register
 * @{
 */
#define MXC_F_GCR_ECCINTEN_FLASH_POS                   0 /**< ECCINTEN_FLASH Position */
#define MXC_F_GCR_ECCINTEN_FLASH                       ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_FLASH_POS)) /**< ECCINTEN_FLASH Mask */

/**@} end of group GCR_ECCINTEN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCADDR GCR_ECCADDR
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECCADDR_DADDR_POS                    0 /**< ECCADDR_DADDR Position */
#define MXC_F_GCR_ECCADDR_DADDR                        ((uint32_t)(0x3FFFUL << MXC_F_GCR_ECCADDR_DADDR_POS)) /**< ECCADDR_DADDR Mask */

#define MXC_F_GCR_ECCADDR_DB_POS                       14 /**< ECCADDR_DB Position */
#define MXC_F_GCR_ECCADDR_DB                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_DB_POS)) /**< ECCADDR_DB Mask */

#define MXC_F_GCR_ECCADDR_DE_POS                       15 /**< ECCADDR_DE Position */
#define MXC_F_GCR_ECCADDR_DE                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_DE_POS)) /**< ECCADDR_DE Mask */

#define MXC_F_GCR_ECCADDR_TADDR_POS                    16 /**< ECCADDR_TADDR Position */
#define MXC_F_GCR_ECCADDR_TADDR                        ((uint32_t)(0x3FFFUL << MXC_F_GCR_ECCADDR_TADDR_POS)) /**< ECCADDR_TADDR Mask */

#define MXC_F_GCR_ECCADDR_TB_POS                       30 /**< ECCADDR_TB Position */
#define MXC_F_GCR_ECCADDR_TB                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_TB_POS)) /**< ECCADDR_TB Mask */

#define MXC_F_GCR_ECCADDR_TE_POS                       31 /**< ECCADDR_TE Position */
#define MXC_F_GCR_ECCADDR_TE                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_TE_POS)) /**< ECCADDR_TE Mask */

/**@} end of group GCR_ECCADDR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLELDOCTRL GCR_BTLELDOCTRL
 * @brief    BTLE LDO Control Register
 * @{
 */
#define MXC_F_GCR_BTLELDOCTRL_BB_EN_POS                0 /**< BTLELDOCTRL_BB_EN Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_EN                    ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_BB_EN_POS)) /**< BTLELDOCTRL_BB_EN Mask */

#define MXC_F_GCR_BTLELDOCTRL_BB_PD_EN_POS             1 /**< BTLELDOCTRL_BB_PD_EN Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_PD_EN                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_BB_PD_EN_POS)) /**< BTLELDOCTRL_BB_PD_EN Mask */

#define MXC_F_GCR_BTLELDOCTRL_BB_VSEL_POS              2 /**< BTLELDOCTRL_BB_VSEL Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_VSEL                  ((uint32_t)(0x3UL << MXC_F_GCR_BTLELDOCTRL_BB_VSEL_POS)) /**< BTLELDOCTRL_BB_VSEL Mask */
#define MXC_V_GCR_BTLELDOCTRL_BB_VSEL_0_9              ((uint32_t)0x0UL) /**< BTLELDOCTRL_BB_VSEL_0_9 Value */
#define MXC_S_GCR_BTLELDOCTRL_BB_VSEL_0_9              (MXC_V_GCR_BTLELDOCTRL_BB_VSEL_0_9 << MXC_F_GCR_BTLELDOCTRL_BB_VSEL_POS) /**< BTLELDOCTRL_BB_VSEL_0_9 Setting */
#define MXC_V_GCR_BTLELDOCTRL_BB_VSEL_1_0              ((uint32_t)0x1UL) /**< BTLELDOCTRL_BB_VSEL_1_0 Value */
#define MXC_S_GCR_BTLELDOCTRL_BB_VSEL_1_0              (MXC_V_GCR_BTLELDOCTRL_BB_VSEL_1_0 << MXC_F_GCR_BTLELDOCTRL_BB_VSEL_POS) /**< BTLELDOCTRL_BB_VSEL_1_0 Setting */
#define MXC_V_GCR_BTLELDOCTRL_BB_VSEL_1_1              ((uint32_t)0x2UL) /**< BTLELDOCTRL_BB_VSEL_1_1 Value */
#define MXC_S_GCR_BTLELDOCTRL_BB_VSEL_1_1              (MXC_V_GCR_BTLELDOCTRL_BB_VSEL_1_1 << MXC_F_GCR_BTLELDOCTRL_BB_VSEL_POS) /**< BTLELDOCTRL_BB_VSEL_1_1 Setting */
#define MXC_V_GCR_BTLELDOCTRL_BB_VSEL_1_2              ((uint32_t)0x3UL) /**< BTLELDOCTRL_BB_VSEL_1_2 Value */
#define MXC_S_GCR_BTLELDOCTRL_BB_VSEL_1_2              (MXC_V_GCR_BTLELDOCTRL_BB_VSEL_1_2 << MXC_F_GCR_BTLELDOCTRL_BB_VSEL_POS) /**< BTLELDOCTRL_BB_VSEL_1_2 Setting */

#define MXC_F_GCR_BTLELDOCTRL_RF_EN_POS                4 /**< BTLELDOCTRL_RF_EN Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_EN                    ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_RF_EN_POS)) /**< BTLELDOCTRL_RF_EN Mask */

#define MXC_F_GCR_BTLELDOCTRL_RF_PD_EN_POS             5 /**< BTLELDOCTRL_RF_PD_EN Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_PD_EN                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_RF_PD_EN_POS)) /**< BTLELDOCTRL_RF_PD_EN Mask */

#define MXC_F_GCR_BTLELDOCTRL_RF_VSEL_POS              6 /**< BTLELDOCTRL_RF_VSEL Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_VSEL                  ((uint32_t)(0x3UL << MXC_F_GCR_BTLELDOCTRL_RF_VSEL_POS)) /**< BTLELDOCTRL_RF_VSEL Mask */
#define MXC_V_GCR_BTLELDOCTRL_RF_VSEL_0_9              ((uint32_t)0x0UL) /**< BTLELDOCTRL_RF_VSEL_0_9 Value */
#define MXC_S_GCR_BTLELDOCTRL_RF_VSEL_0_9              (MXC_V_GCR_BTLELDOCTRL_RF_VSEL_0_9 << MXC_F_GCR_BTLELDOCTRL_RF_VSEL_POS) /**< BTLELDOCTRL_RF_VSEL_0_9 Setting */
#define MXC_V_GCR_BTLELDOCTRL_RF_VSEL_1_0              ((uint32_t)0x1UL) /**< BTLELDOCTRL_RF_VSEL_1_0 Value */
#define MXC_S_GCR_BTLELDOCTRL_RF_VSEL_1_0              (MXC_V_GCR_BTLELDOCTRL_RF_VSEL_1_0 << MXC_F_GCR_BTLELDOCTRL_RF_VSEL_POS) /**< BTLELDOCTRL_RF_VSEL_1_0 Setting */
#define MXC_V_GCR_BTLELDOCTRL_RF_VSEL_1_1              ((uint32_t)0x2UL) /**< BTLELDOCTRL_RF_VSEL_1_1 Value */
#define MXC_S_GCR_BTLELDOCTRL_RF_VSEL_1_1              (MXC_V_GCR_BTLELDOCTRL_RF_VSEL_1_1 << MXC_F_GCR_BTLELDOCTRL_RF_VSEL_POS) /**< BTLELDOCTRL_RF_VSEL_1_1 Setting */
#define MXC_V_GCR_BTLELDOCTRL_RF_VSEL_1_2              ((uint32_t)0x3UL) /**< BTLELDOCTRL_RF_VSEL_1_2 Value */
#define MXC_S_GCR_BTLELDOCTRL_RF_VSEL_1_2              (MXC_V_GCR_BTLELDOCTRL_RF_VSEL_1_2 << MXC_F_GCR_BTLELDOCTRL_RF_VSEL_POS) /**< BTLELDOCTRL_RF_VSEL_1_2 Setting */

