analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/gcr_regs.h
#define MXC_F_GCR_BTLELDOCTRL_RF_BP_EN_POS             8 /**< BTLELDOCTRL_RF_BP_EN Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_BP_EN                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_RF_BP_EN_POS)) /**< BTLELDOCTRL_RF_BP_EN Mask */

#define MXC_F_GCR_BTLELDOCTRL_RF_DISCH_POS             9 /**< BTLELDOCTRL_RF_DISCH Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_DISCH                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_RF_DISCH_POS)) /**< BTLELDOCTRL_RF_DISCH Mask */

#define MXC_F_GCR_BTLELDOCTRL_BB_BP_EN_POS             10 /**< BTLELDOCTRL_BB_BP_EN Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_BP_EN                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_BB_BP_EN_POS)) /**< BTLELDOCTRL_BB_BP_EN Mask */

#define MXC_F_GCR_BTLELDOCTRL_BB_DISCH_POS             11 /**< BTLELDOCTRL_BB_DISCH Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_DISCH                 ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_BB_DISCH_POS)) /**< BTLELDOCTRL_BB_DISCH Mask */

#define MXC_F_GCR_BTLELDOCTRL_BB_EN_DLY_POS            12 /**< BTLELDOCTRL_BB_EN_DLY Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_EN_DLY                ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_BB_EN_DLY_POS)) /**< BTLELDOCTRL_BB_EN_DLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_RF_EN_DLY_POS            13 /**< BTLELDOCTRL_RF_EN_DLY Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_EN_DLY                ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_RF_EN_DLY_POS)) /**< BTLELDOCTRL_RF_EN_DLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_RF_BP_EN_DLY_POS         14 /**< BTLELDOCTRL_RF_BP_EN_DLY Position */
#define MXC_F_GCR_BTLELDOCTRL_RF_BP_EN_DLY             ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_RF_BP_EN_DLY_POS)) /**< BTLELDOCTRL_RF_BP_EN_DLY Mask */

#define MXC_F_GCR_BTLELDOCTRL_BB_BP_EN_DLY_POS         15 /**< BTLELDOCTRL_BB_BP_EN_DLY Position */
#define MXC_F_GCR_BTLELDOCTRL_BB_BP_EN_DLY             ((uint32_t)(0x1UL << MXC_F_GCR_BTLELDOCTRL_BB_BP_EN_DLY_POS)) /**< BTLELDOCTRL_BB_BP_EN_DLY Mask */

/**@} end of group GCR_BTLELDOCTRL_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_BTLELDODLY GCR_BTLELDODLY
 * @brief    BTLE LDO Delay Register
 * @{
 */
#define MXC_F_GCR_BTLELDODLY_BP_CNT_POS                0 /**< BTLELDODLY_BP_CNT Position */
#define MXC_F_GCR_BTLELDODLY_BP_CNT                    ((uint32_t)(0xFFUL << MXC_F_GCR_BTLELDODLY_BP_CNT_POS)) /**< BTLELDODLY_BP_CNT Mask */

#define MXC_F_GCR_BTLELDODLY_BB_CNT_POS                8 /**< BTLELDODLY_BB_CNT Position */
#define MXC_F_GCR_BTLELDODLY_BB_CNT                    ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLELDODLY_BB_CNT_POS)) /**< BTLELDODLY_BB_CNT Mask */

#define MXC_F_GCR_BTLELDODLY_RF_CNT_POS                20 /**< BTLELDODLY_RF_CNT Position */
#define MXC_F_GCR_BTLELDODLY_RF_CNT                    ((uint32_t)(0x1FFUL << MXC_F_GCR_BTLELDODLY_RF_CNT_POS)) /**< BTLELDODLY_RF_CNT Mask */

/**@} end of group GCR_BTLELDODLY_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_GCR_REGS_H_
